"""
در پایتون، می‌توان از عملگرهای مقایسه‌ای به صورت زنجیره‌ای (Chaining) استفاده کرد. به عنوان مثال، عبارت a < b <= c معادل دو مقایسه جداگانه است: a < b و b <= c. این امکان را به شما می‌دهد که چندین مقایسه را در یک عبارت واحد انجام دهید.

وظیفه شما: برنامه‌ای بنویسید که سه عدد ورودی دریافت کند و بررسی کند که آیا عدد اول کمتر از عدد دوم و عدد دوم کمتر یا مساوی عدد سوم است یا خیر.

ورودی‌ها:

سه عدد صحیح به نام‌های a, b و c.

خروجی‌ها:

اگر شرط a < b <= c برقرار باشد، خروجی True را نمایش دهید.
در غیر این صورت، خروجی False را نمایش دهید.

ورودی نمونه:

5
10
15

خروجی نمونه :

True
 

راهنمایی:
برای ورودی گرفتن از کاربر می‌توانید از دستور زیر استفاده کنید:

a=input()

حال اگر بخواهیم این ورودی همزمان به int تبدیل شود داریم:

a = int(input())

در ادامه با این دستور بیشتر آشنا خواهید شد.
"""

# دریافت ورودی‌ها از کاربر
a = int(input("Enter first number:"))
b = int(input("Enter second number: "))
c = int(input("Enter third number: "))

# بررسی شرط به صورت زنجیره‌ای
result = a < b <= c

# چاپ خروجی

print(result)

