"""
یک فروشگاه تخفیف‌های ویژه‌ای برای مشتریان در نظر گرفته است. قوانین تخفیف به شرح زیر است:

اگر مبلغ خرید بیشتر از ۵۰۰۰۰ تومان باشد، تخفیف ۲۰٪ اعمال می‌شود.
اگر مبلغ خرید بین ۲۰۰۰۰ تا ۵۰۰۰۰ تومان باشد، تخفیف ۱۰٪ اعمال می‌شود.
اگر مبلغ خرید کمتر از ۲۰۰۰۰ تومان باشد، تخفیفی اعمال نمی‌شود.

برنامه‌ای بنویسید که مبلغ خرید را از کاربر دریافت کند و مقدار مبلغ نهایی را نمایش دهد.
ورودی ۱:

55000


خروجی ۱:

44000
"""
amount = int(input("please enter the amount: "))

if amount > 50000:
    final_price = amount * 0.8  # تخفیف 20 درصد
elif amount >= 20000:
    final_price = amount * 0.9  # تخفیف 10 درصد
else:
    final_price = amount        # بدون تخفیف

print(int(final_price))

