"""
در این تمرین، شما باید یک تابع به نام sum_numbers(*args) تعریف کنید که بتواند هر تعداد عدد را دریافت کرده و مجموع آن‌ها را برگرداند.

وظیفه شما:
یک تابع به نام sum_numbers(*args) بنویسید که:تعداد نامحدودی از اعداد را به عنوان ورودی دریافت کند.
مجموع این اعداد را محاسبه کرده و برگرداند (return).
اگر هیچ عددی ارسال نشود، مقدار 0 را برگرداند.

ورودی‌ها:
صفر یا چندین عدد صحیح که به تابع sum_numbers ارسال می‌شوند.

خروجی‌ها:
عددی که نشان‌دهنده مجموع تمام ورودی‌ها باشد.
اگر هیچ ورودی‌ای ارسال نشود، مقدار 0 برگردانده شود.

مثال‌های ورودی و خروجی:
ورودی نمونه 1:

5 10 15

خروجی مورد انتظار 1:

30
 

ورودی نمونه 2:

7 3 2 1 9

خروجی مورد انتظار 2:

22

چون 7 + 3 + 2 + 1 + 9 = 22
"""

def sum_numbers(*args):
    if not args:
        return 0 
    return sum(args)

print(sum_numbers(5,10,15))
print(sum_numbers(7,3,2,1,9))
print(sum_numbers())